Repository: BriceNocenti/tabxplor
Catalog: jamovi/i18n/*.po
Languages: fr

source: <b>col_vars = <i>(column variables)</i></b>
fr: <b>col_vars = <i>(variables de colonne)</i></b>

source: <b>Confidence intervals</b>
fr: <b>Intervalles de confiance</b>

source: <b>Levels and missing values</b>
fr: <b>Valeurs manquantes et modalités</b>

source: <b>Other formatting</b>
fr: <b>Autres mises en forme</b>

source: <b>Percentages, colors and Chi2 test </b>
fr: <b>Pourcentages, couleurs et test du Chi2</b>

source: <b>References (points of comparison)</b>
fr: <b>Références (points de comparaison)</b>

source: <b>row_vars = <i>(row variable)</i></b>
fr: <b>row_vars = <i>(variable de ligne)</i></b>

source: <b>tab_vars = <i>(subtables variables)</i></b>
fr: <b>tab_vars = <i>(variables de sous-tableaux)</i></b>

source: <b>wt = <i>(weights)</i></b>
fr: <b>wt = <i>(poids)</i></b>

source: add_n = <i>(see unweighted counts)</i>
fr: add_n = <i>(voir effectifs non pondérés)</i>

source: add_pct = <i>(see frequencies of 100% total)</i>
fr: add_pct = <i>(voir freq. des totaux à 100%)</i>

source: after_ci <i>(diff, after substracting margin of error)</i>
fr: after_ci <i>(diff, après soustraction marge d'erreur)</i>

source: all <i>(compare with the total subtable)</i>
fr: all <i>(comparer avec le total général)</i>

source: auto/tot/<i>{row_number}</i>/<i>{row_name}</i>
fr: auto/tot/<i>{num_ligne}</i>/<i>{nom_ligne}</i>

source: cell <i>(ci for each cell)</i>
fr: cell <i>(IC pour chaque case)</i>

source: chi2 = <i>(Chi2 test)</i>
fr: chi2 = <i>(test du Chi2)</i>

source: Chi2 Test
fr: Test du Chi2

source: ci <i>(confidence intervals)</i>
fr: ci <i>(IC, intervalles de confiance)</i>

source: ci <i>(interval display: [inf;sup])</i>
fr: ci <i>(format: [inf;sup])</i>

source: ci = <i>(confidence intervals)</i>
fr: ci = <i>(intervalles de confiance, IC)</i>

source: cleannames =
fr: cleannames = <i>(nettoyer noms)</i>

source: col (column)
fr: col (colonne)

source: color = (Color)
fr: color = (Couleur)

source: color = <i>(what to use for color helpers)</i>
fr: color = <i>(aides à l'interprétation)</i>

source: comp = <i>(reference table with tab_vars)</i>
fr: comp = <i>(tableau de référence, avec tab_vars)</i>

source: conf_level = <i>(confidence level)</i>
fr: conf_level = <i>(seuil de confiance)</i>

source: contrib <i>(relative contribution to variance)</i>
fr: contrib <i>(contribution relative à la variance)</i>

source: Crosstables
fr: Tableaux croisés

source: ctr <i>(relative contributions to variance)</i>
fr: ctr <i>(contribution relative à la variance)</i>

source: diff <i>(ci on the difference with reference)</i>
fr: diff <i>(IC sur la différence avec la référence)</i>

source: diff <i>(differences from total, or reference cell)</i>
fr: diff <i>(différences par rapport au total/référence)</i>

source: diff_ci <i>(differences, only if significant)</i>
fr: diff_ci <i>(différences, seulement si significatives)</i>

source: digits = <i>(number of digits)</i>
fr: digits = <i>(nombre de chiffres après la virgule)</i>

source: display = <i>(which information to display in the table ?)</i>
fr: display = <i>(quelle information afficher dans le tableau ?)</i>

source: drop <i>(for each col_var)</i>
fr: drop <i>(enlever, par col_var)</i>

source: drop_all <i>(for all col_vars)</i>
fr: drop_all <i>(pour toutes)</i>

source: first/tot/<i>{col_number}</i>
fr: first/tot/<i>{num_colonne}</i>

source: keep
fr: keep (conserver NAs)

source: levels = <i>(which lvs to keep)</i>
fr: levels = <i>(modalités)</i>

source: line
fr: line (seulement une ligne)

source: Make it easy to deal with multiple cross-tables in data exploration, by creating them, manipulating them, and adding color helpers to highlight important informations (differences from totals, comparisons between lines or columns, contributions to variance, confidence intervals, odds ratios, etc.). All functions are pipe-friendly and render data frames which can be easily manipulated. In the same time, time-taking operations are done with 'data.table' to go faster with big dataframes. Tables can be exported to 'Excel', plot and html with formats and colors.
fr: Tableaux croisés multiples faciles à manipuler en exploration de données, avec aides à l'interprétation pour colorer les informations importantes (différences par rapport au total, comparaison entre lignes, contributions à la variance, intervalles de confiance, rapports de chances, etc.) Toutes les fonctions sont adaptées au pipe (|> ou %>%) et retournent des data.frames aisément manipulables. Les opérations les plus lourdes sont réalisées en `data.table` pour gagner du temps avec les grandes bases de données. Les tableaux peuvent être exportés en format `Excel`, graphique ou html avec la mise en forme et les couleurs.

source: mean <i>(mean, for numeric variables)</i>
fr: mean <i>(moyenne, pour les variables numériques)</i>

source: mean_ci <i>(means with visible conf. intervals)</i>
fr: mean_ci <i>(moyennes avec IC visibles)</i>

source: moe <i>(display: pct±margin of error)</i>
fr: moe <i>(format: pct±marge d'ereur)</i>

source: n <i>(unweighted counts)</i>
fr: n <i>(effectifs non pondérés)</i>

source: na = <i>(missing values)</i>
fr: na = <i>(valeurs manquantes)</i>

source: no (counts)
fr: no (effectifs)

source: OR <i>(odds ratios or relative risks ratios)</i>
fr: OR <i>(odds ratios, rapports de chance)</i>

source: OR = <i>(Odds Ratio)</i>
fr: OR = <i>(Odds Ratio, rapports de chance)</i>

source: OR_pct
fr: OR_pct <i>(odds ratios, % visibles)</i>

source: OR_pct <i>(odds ratios with visible percentages)</i>
fr: OR_pct <i>(odds ratios avec pourcentages visibles)</i>

source: other_if_less_than =
fr: other_if_less_than = <br> <i>(regrouper modalités rares)</i>

source: pct <i>(percentages)</i>
fr: pct <i>(pourcentages)</i>

source: pct = (Percentages)
fr: pct = (Pourcentages)

source: pct = <i>(type of percentages)</i>
fr: pct = <i>(type de pourcentages)</i>

source: pct_ci <i>(percentages with visible conf. intervals)</i>
fr: pct_ci <i>(pourcentages avec IC visibles)</i>

source: ref = <i>(reference row/col for diff/OR)</i>
fr: ref = <i>(ligne/col de référence pour diff/OR)</i>

source: ref2 = <i>(2nd reference col/row for OR)</i>
fr: ref2 = <i>(2e col/ligne de référence pour OR)</i>

source: row
fr: row (ligne)

source: subtext = <i>(text to print below the table)</i>
fr: subtext = <i>(texte en dessous du tableau)</i>

source: tab <i>(compare in each subtable)</i>
fr: tab <i>(comparer par sous-tableaux)</i>

source: table
fr: table (sous-tableau complet)

source: Table
fr: Tableau

source: The row variable, which will be printed with one level per line. If numeric, it will be converted to factor.
fr: La variable de ligne, affichée avec une modalité sur chaque ligne. Si numérique, elle sera convertie en variable catégorielle.

source: totaltab = <i>(add a total table)</i>
fr: totaltab = <i>(ajouter un tableau Total général)</i>

source: totaltab = <i>(with tab_vars, add a total table)</i>
fr: totaltab = <i>(avec tab_vars, ajouter un tableau Total général)</i>

source: User-Friendly Tables with Color Helpers for Data Exploration
fr: Tableaux avec aides à l'interprétation pour l'exploration de données

source: wn <i>(weighted counts)</i>
fr: wn <i>(effectifs pondérés)</i>

source: wrap_cols = <i>(nb chars for line break)</i>
fr: wrap_cols = <i>(nb lettres avant saut de ligne)</i>

source: wrap_rows = <i>(nb chars for line break)</i>
fr: wrap_rows = <i>(nb lettres avant saut de ligne)</i>
